cmsis-svd/cmsis-svd/data/Microchip/ATSAM4CMxxC_1.svd
        <register>
          <name>WUMR</name>
          <description>Supply Controller Wake-up Mode Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FWUPEN</name>
              <description>Force Wake-up Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The force wake-up pin has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The force wake-up pin low forces a system wake-up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMEN</name>
              <description>Supply Monitor Wake-up Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The supply monitor detection has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The supply monitor detection forces a system wake-up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTTEN</name>
              <description>Real-time Timer Wake-up Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The RTT alarm signal has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The RTT alarm signal forces a system wake-up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCEN</name>
              <description>Real-time Clock Wake-up Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The RTC alarm signal has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The RTC alarm signal forces a system wake-up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBCEN0</name>
              <description>Low-Power Debouncer Enable WKUP0/TMP0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The WKUP0/TMP0 input pin is not connected to the low-power debouncer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The WKUP0/TMP0 input pin is connected to the low-power debouncer and can force a system wake-up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBCEN1</name>
              <description>Low-Power Debouncer Enable WKUP10/TMP1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>The WKUP10/TMP1 input pin is not connected to the low-power debouncer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The WKUP10/TMP1 input pin is connected to the low-power debouncer and can force a system wake-up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBCCLR</name>
              <description>Low-Power Debouncer Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>A low-power debounce event does not create an immediate clear on the first half of GPBR registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>A low-power debounce event on WKUP0/TMP0 or WKUP10TMP1(if DISTMPCLR1 is cleared) generates an immediate clear on the first half of GPBR registers.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWUPDBC</name>
              <description>Force Wake-up Debouncer Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate, no debouncing, detected active at least on one Slow Clock edge.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_SCLK</name>
                  <description>FWUP shall be low for at least 3 SLCK periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_SCLK</name>
                  <description>FWUP shall be low for at least 32 SLCK periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_SCLK</name>
                  <description>FWUP shall be low for at least 512 SLCK periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096_SCLK</name>
                  <description>FWUP shall be low for at least 4,096 SLCK periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32768_SCLK</name>
                  <description>FWUP shall be low for at least 32,768 SLCK periods</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPDBC</name>
              <description>Wake-up Inputs Debouncer Period</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate, no debouncing, detected active at least on one Slow Clock edge.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 3 SLCK periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 32 SLCK periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 512 SLCK periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 4,096 SLCK periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32768_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 32,768 SLCK periods</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBC</name>
              <description>Low Power Debouncer Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the low-power debouncers.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_RTCOUT0</name>
                  <description>WKUP0/10TMP0/1 in active state for at least 2 RTCOUT0 periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_RTCOUT0</name>
                  <description>WKUP0/10TMP0/1 in active state for at least 3 RTCOUT0 periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_RTCOUT0</name>
                  <description>WKUP0/10TMP0/1 in active state for at least 4 RTCOUT0 periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_RTCOUT0</name>
                  <description>WKUP0/10TMP0/1 in active state for at least 5 RTCOUT0 periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_RTCOUT0</name>
                  <description>WKUP0/10TMP0/1 in active state for at least 6 RTCOUT0 periods</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7_RTCOUT0</name>
                  <description>WKUP0/10TMP0/1 in active state for at least 7 RTCOUT0 periods</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_RTCOUT0</name>
                  <description>WKUP0/10TMP0/1 in active state for at least 8 RTCOUT0 periods</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISTMPCLR1</name>
              <description>Disable GPBR Clear Command from WKUP10/TMP1 pin</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The WKUP10/TMP1 input pin can clear the GPBR (if LPDBCCLR is enabled) when tamper is detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The WKUP10/TMP1 input pin has no effect on the GPBR value (no clear on tamper detection).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISTSTMP1</name>
              <description>Disable Timestamp from WKUP10/TMP1 Pin</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>A tamper detection on WKUP10/TMP1 pin generates a timestamp.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>A tamper detection on WKUP10/TMP1 does NOT generate a report in timestamp register.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
